{
   "intents":[
      {
         "tag":"greeting",
         "patterns":[
            "Hi",
            "Hey",
            "Hello",
            "I am fine. And you?",
            "How are you",
            "Is there anyone",
            "Good Morning, I need some help",
            "Howdy !!",
            "Hey, I have a question regarding investments.",
            "Hello, Good Day ! How are you ?",
	    "Hello, I had a question.",
  	    "Hi! How is your day going so far?",
	    "Hello, hope you day is going well.",
	    "Hi, I was hoping you could help me with some queries",
	    "Hi, can you help me?",
	    "Is someone there?",
	    "Is someone online?",
	    "Is this an actual person?"
         ],
         "response":[
            "Hey there, friend! I'm InvestoBot, the chatbot for helping you make better investments. Before we proceed ahead, may I know your name?"
         ]
      },
      {
         "tag":"name",
         "patterns":[
            "I am ",
            "my name is ",
            " is my name",
            " is my full name",
            "my full name is "
         ],
         "response":[
            "Thank you ! Do you have an investment portfolio account with us?"
         ]
      },
      {
         "tag":"yesAccount",
         "patterns":[
            "Yes, I have an account",
            "Yes, I have an investment portfolio account",
            "I have the portfolio",
            "I have the investment portfolio",
            "Yes, I have the portfolio"
         ],
         "response":[
            "Great! Kindly enter your 9 digit account number."
         ]
      },
      {
         "tag":"noAccount",
         "patterns":[
            "Do I need to have an account?",
            "Sorry, I am unable to find my account number.",
            "No, I do not have an account number",
            "No, I do not have an investment portfolio account number",
            "No, I do'nt have an account number",
            "No, I don't have an investment portfolio account number"
         ],
         "response":[
            "Ok. No problems. Would you like to know some interesting things about investment?"
         ]
      },
      {
         "tag":"yes",
         "patterns":[
            "Yes",
            "Sure",
            "Why not?",
            "I am interested",
            "Yes, I am interested",
	    " Yes Please"
         ],
         "response":[

         ]
      },
      {
         "tag":"no",
         "patterns":[
            "No",
            "Not interested",
            "I am not interested",
            "Sorry, not interested",
	    "Not really"
         ],
         "response":[

         ]
      },
      {
         "tag":"accountNumberEntered",
         "patterns":[
            "My account number is ",
            " is my account number.",
            "Account number - "
         ],
         "response":[
            "Thank you. This is how your portfolio looks currently. Would you like to optimize it for higher gains?",
            "Thank you. However, I am unable to find your account details. Kindly re-enter the correct account number."
         ]
      },
      {
         "tag":"yesPortfolioOptimize",
         "patterns":[
            "Yes, I will optimize it",
            "Yes, I will optimize my portfolio",
            "Yes, I would like to optimize it",
            "Yes, I would like to optimize my portfolio",
	    "Yes, I need help with optimization"
         ],
         "response":[
            "After optimization, your portfolio evaluation is . It is higher than your current evaluation by dollars. Kindly drop by our office, if you want to update your portfolio allocations. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"noPortfolioOptimize",
         "patterns":[
            "No, I am happy",
            "No, I don't want to optimize it",
            "No, I do not want to optimize my portfolio",
            "No, I would not like to optimize it",
            "No, I would not like to optimize my portfolio",
	    "I don't really want to optimize my profile",
	    "No, maybe next time !!"
         ],
         "response":[
            "Ok. No problems. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"yesInvestment",
         "patterns":[
            "I need your help with investments",
            "Sure, tell me something about investments",
            "How can you simplify my investment?",
            "I have'nt done this before",
            "Yes, I would like to know about investments",
            "I would like to know about investments",
            "Yes, I want to know about investments", 
            "I would like to know about investing",
            "how can you help me with investments?"
         ],
         "response":[
            "Awesome! Here are some types of investments. I can help you make investments in 4 categories - Personal, Education, Retirement and Charity. Please enter the type of investment to get more information about it."
         ]
      },
      {
         "tag":"noInvestment",
         "patterns":[
            "I do not need your help with investments",
            "Sorry, I don't need any investment tips",
            "I don't want to know about investments"
         ],
         "response":[
            "Ok. No problems. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"charityInvestment",
         "patterns":[
            "I need your help with charity investments",
            "charity investments",
            "Tell me about charity investments",
            "charity"
         ],
         "response":[
            "We help you plan your investment strategies before trustees make any decisions about your investments which includes what to invest in and how the investments fit in with these plans. In assition, we will review your investments from time to time and include information about your investment policy in the trustees' annual report. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"educationInvestment",
         "patterns":[
            "I need your help with educational investments",
            "educational investments",
            "Tell me about educational investments",
            "educational",
            "I need your help with education investments",
            "education investments",
            "Tell me about education investments",
            "education"
         ],
         "response":[
            "We recommends you multiply your child’s age by $2,000 to figure out how much you should save and invest as well as help you with Education Savings Account, Bonds, and a combination of strategies. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"retirementInvestment",
         "patterns":[
            "I need your help with retirement investments",
            "retirement investments",
            "Tell me about retirement investments",
            "retirement"
         ],
         "response":[
            "We provide assistance with guiding you through a retirement plan that's offered by your employer, such as a 401(k) or 403(b) plan, tax-advantaged retirement account such as an IRA that offer similar tax breaks to 401(k)s, regular investment account that doesn't have tax advantages, and Long-term stock investment, with some Bonds. We make sure to include broadly diversified international stock funds and REITs in your investment mix and sticking with low-fee index funds will keep your investing costs in check. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"personalInvestment",
         "patterns":[
            "I need your help with personal investments",
            "Personal investments",
            "Tell me about personal investments",
            "Personal"
         ],
         "response":[
            "I can help you make personal investments in 4 categories - Stocks, Mutual Funds, Bonds and Foreign Exchange. Please enter the type of personal investment to get more information about it."
         ]
      },
      {
         "tag":"foreignExchangeInvestment",
         "patterns":[
            "I need your help with foreign Exchange investments",
            "foreign Exchange investments",
            "Tell me about foreign Exchange investments",
            "foreign Exchange"
         ],
         "response":[
            "There are a number of ways to invest in the foreign exchange market - Forex, Foreign Currency Futures, Foreign Currency Options, Exchange-traded funds (ETFs) and exchange-traded notes (ETNs), and Foreign Bond Funds. We help you understand theri risks and benefits in different trading markets. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"bondsInvestment",
         "patterns":[
            "I need your help with bonds investments",
            "bonds investments",
            "Tell me about bonds investments",
            "bonds"
         ],
         "response":[
            "Bonds come in a variety of options, each with its own set of benefits and drawbacks. We provide you assistance with regards to Corporate Bonds, Municipal Bonds, and Treasury Bonds and we'll expose the risks that could effect your hard-earned profits. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"mutualFundsInvestment",
         "patterns":[
            "I need your help with mutual Funds investments",
            "mutual Funds investments",
            "Tell me about mutual Funds investments",
            "mutual Funds"
         ],
         "response":[
            "We find the best way to generate optimum risk-adjusted returns from mutual funds is to build a diversified mutual fund portfolio consisting of multiple asset classes which helps you maintain steady return and make your investment as per your increasing age where slight variation in percentage can be made as per one’s risk-taking capacity and review them in a timely manner. Kindly contact our office to know more about it. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"stocksInvestment",
         "patterns":[
            "I need your help with stocks investments",
            "stocks investments",
            "Tell me about stocks investments",
            "stocks"
         ],
         "response":[
            "Sure. Here is a fact about stocks investment. We currently support stock investment in the following 5 stocks: Google, Facebook, Microsoft, Apple and Twitter. Would you like to know more about any of these stocks?"
         ]
      },
      {
         "tag":"yesStockInvestment",
         "patterns":[
            "Yes, I would like to know more about these stocks",
            "Sure, tell me something about these stocks",
            "how can you help me with these stocks?",
            "Yes, I would like to know more about all stocks",
            "Sure, tell me something about all stocks",
            "how can you help me with all stocks?",
            "Yes, I would like to know more about Google",
            "Sure, tell me something about Google",
            "how can you help me with Google?",
            "Yes, I would like to know more about Facebook",
            "Sure, tell me something about Facebook",
            "how can you help me with Facebook?",
            "Yes, I would like to know more about Apple",
            "Sure, tell me something about Apple",
            "how can you help me with Apple?",
            "Yes, I would like to know more about Microsoft",
            "Sure, tell me something about Microsoft",
            "how can you help me with Microsoft?",
            "Yes, I would like to know more about Twitter",
            "Sure, tell me something about Twitter",
            "how can you help me with Twitter?",
            "Yes, I would like to know more about GOOGL",
            "Sure, tell me something about GOOGL",
            "how can you help me with GOOGL?",
            "Yes, I would like to know more about FB",
            "Sure, tell me something about FB",
            "how can you help me with FB?",
            "Yes, I would like to know more about AAPL",
            "Sure, tell me something about AAPL",
            "how can you help me with AAPL?",
            "Yes, I would like to know more about MSFT",
            "Sure, tell me something about MSFT",
            "how can you help me with MSFT?",
            "Yes, I would like to know more about TWTR",
            "Sure, tell me something about TWTR",
            "how can you help me with TWTR?"
         ],
         "response":[
            "Awesome! Below is some information you maybe interested in. I hope this helps you and you create a portfolio with us. If you need to create a portfolio or know more about stock investment, kindly contact our office. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"noStockInvestment",
         "patterns":[
            "Do you have any other stock options?",
            "Do you support any other stocks?",
            "Sorry, I want to invest in other stocks",
            "Sorry, I don't want to invest in any of these stocks",
            "I don't want to know about any of these stocks"
         ],
         "response":[
            "Sorry! We support only these stocks currently but we are consistently adding new stock support. Kindly contact our office to know more about when the stock of your interest will be supported. Kindly type quit to exit or type Hello to continue chatting with me."
         ]
      },
      {
         "tag":"exit",
         "patterns":[
            "Have a great day",
            "it was great to chat",
            "Thanks investobot for the insights",
            "goodbye",
            "bye",
            "Sure will do."
         ],
         "response":[
            "Thank you for chatting with me. Have a great day!"
         ]
      }
   ]
}